---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures
source: html/b752987a-9e5b-5ea8-be98-faf22647b6f7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures

Failures about WallJoinRoof.

## Syntax (C#)
```csharp
public static class WallJoinRoofFailures
```